html/meeting-notes/2012-10-16.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Meeting Notes 2012-10-16</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Meeting Notes 2012-10-16"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-11-02 16:03:40 EDT"/>
<meta name="author" content="Andrew Braunstein"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="sitemap.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Meeting Notes 2012-10-16</h1>


<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-30426956-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>




<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Perry Metzger</a></li>
<li><a href="#sec-2">Elisp</a></li>
<li><a href="#sec-3">No meeting next week (fall break)</a></li>
<li><a href="#sec-4">Andrew will get food for the week after</a></li>
<li><a href="#sec-5">More pages on the website for specific courses at penn</a></li>
<li><a href="#sec-6">o-blog</a></li>
<li><a href="#sec-7">exec-path-from-shell</a></li>
<li><a href="#sec-8">Mish guarantees a good time</a></li>
<li><a href="#sec-9">Hongling shows off auctex</a></li>
<li><a href="#sec-10">Mish shows off yasnippets</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Perry Metzger</h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>We should get him to talk
</li>
</ul>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Elisp</h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>elisp hw from ocaml
</li>
<li>maybe not the best idea
<ul>
<li>Antony "shit may hit the fan"
</li>
</ul>

</li>
</ul>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">No meeting next week (fall break)</h2>
<div class="outline-text-2" id="text-3">


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Andrew will get food for the week after</h2>
<div class="outline-text-2" id="text-4">


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">More pages on the website for specific courses at penn</h2>
<div class="outline-text-2" id="text-5">

<ul>
<li>240 "c"
</li>
<li>Machine Learning "matlab"
</li>
<li>DP site will link
</li>
<li>120 and higher
</li>
</ul>


</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">o-blog</h2>
<div class="outline-text-2" id="text-6">

<ul>
<li>Org mode -&gt; blog
</li>
<li>Try this out for the emacs club website
</li>
<li>Bootstrap support
</li>
<li>More robust than simple org mode export
</li>
</ul>


</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7">exec-path-from-shell</h2>
<div class="outline-text-2" id="text-7">

<ul>
<li>Make sure your emacs path is your OSX path
</li>
<li>package-install is broken, need to list packages to install
</li>
</ul>


</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8">Mish guarantees a good time</h2>
<div class="outline-text-2" id="text-8">


</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9">Hongling shows off auctex</h2>
<div class="outline-text-2" id="text-9">

<ul>
<li>It's awesome
</li>
</ul>


</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10">Mish shows off yasnippets</h2>
<div class="outline-text-2" id="text-10">

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-11-02 16:03:40 EDT</p>
<p class="author">Author: Andrew Braunstein</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
